<?php
    
       // 問１100円のトマト、200円のレタス、300円のアボカドという配列を作成し、アボカドだけ取り出す。
       
  
       $array=array("tomato"=>100,"retasu"=>200,"abakado"=>300);
       
       $array["ren"]=150;
       echo $array["ren"];
       
      //  問２　問１の配列にcallor150円を追加して、作成し、取り出す。
       
       
       
       
       
       
       
    //    反省 0918
    // =>を=にしがち
       
       
       
       
       
       
       
       
       
       
       
       
      
    
    
    
    
    
    
    
    
    










    
    
    
    
    
    
    
    
    
    
    
    
    
    // 100円のトマト、200円のレタス、300円のアボカドという配列を作成し、アボカドだけ取り出す。
    // $foods=array('tomato'=>100,'retasu'=>200,'abocado'=>300);
    // echo $foods['retasu'];

   　//    反省 0918
    // =>を=にしがち

    //反省
    // ->と=>を間違える
    // {}と()を間違える
    //反省9.19
    // {}と()
    // arrayを忘れる。対策としては(),=>は配列系、{}->は関数系と覚えよう

   //  反省9.21   
      //  連想配列を追加するのであれば
      //  $array["キー"]="値" 

// 　 // 解答　問２　問１の配列にcallor150円を追加して、作成し、取り出す。
      //  $array=array("tomato"=>100,"retasu"=>200,"abakado"=>300); 
      //  $array["ren"]=150;
      //  echo $array["ren"];
       






?>